performance/tsung/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" []>
<tsung loglevel="notice" version="1.0" dumptraffic="false">

  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>
  
  <servers>
    <server host="t1.oae-performance.sakaiproject.org" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="2" unit="minute">
      <users arrivalrate="24" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="2" unit="minute">
      <users arrivalrate="26" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="2" unit="minute">
      <users arrivalrate="28" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="2" unit="minute">
      <users arrivalrate="30" unit="second"/>
    </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
   <option name="file_server" id="usersdb" value="./data/users.csv"/>
  </options>

  <sessions>
    <session name="update-profile" probability="100" type="ts_http">
  
      <setdynvars sourcetype="file" fileid="usersdb" delimiter="," order="iter">
        <var name="users_username"/>
        <var name="users_pw"/>
      </setdynvars>
      <setdynvars sourcetype="random_string" length="8">
        <var name="rnd_short_str" />
      </setdynvars>
      <setdynvars sourcetype="random_string" length="128">
        <var name="rnd_medium_str" />
      </setdynvars>
      <setdynvars sourcetype="random_string" length="1024">
        <var name="rnd_long_str" />
      </setdynvars>
  
      <transaction name="tx_login">
        <request subst="true">
          <dyn_variable name="dyn_userid" jsonpath="$.id"/>
          <http url="/api/auth/login" method="POST" version="1.1" contents="username=%%_users_username%%&amp;password=%%_users_pw%%"/>
        </request>
      </transaction>
      <transaction name="tx_me">
        <request>
          <http url="/api/me" method="GET" version="1.1"></http>
        </request>
      </transaction>
            
      <transaction name="tx_think">
        <thinktime value="3" random="true" />
      </transaction>
      
      <transaction name="tx_view_profile">
        <request subst="true">
          <http url="/api/user/%%_dyn_userid%%/profile" method="GET" version="1.1"></http>
        </request>
      </transaction>
      <transaction name="tx_me">
        <request>
          <http url="/api/me" method="GET" version="1.1"></http>
        </request>
      </transaction>
      
      <transaction name="tx_think">
        <thinktime value="3" random="true" />
      </transaction>
      
      <transaction name="tx_update_profile">
        <request subst="true">
          <http url="/api/user/%%_dyn_userid%%/profile" method="POST" version="1.1"
              contents="section=%%_rnd_short_str%%&amp;data=%7B%22%%_rnd_short_str%%%22%3A%22%%_rnd_long_str%%%22%7D"></http>
        </request>
        <request subst="true">
          <http url="/api/user/%%_dyn_userid%%/profile" method="GET" version="1.1"></http>
        </request>
      </transaction>
      <transaction name="tx_me">
        <request>
          <http url="/api/me" method="GET" version="1.1"></http>
        </request>
      </transaction>
      
      <transaction name="tx_think">
        <thinktime value="3" random="true" />
      </transaction>
      
      <transaction name="tx_logout">      
        <request>
          <http url="/api/auth/logout" method="POST" version="1.1"/>
        </request>
      </transaction>
      <transaction name="tx_me">
        <request>
          <http url="/api/me" method="GET" version="1.1"></http>
        </request>
      </transaction>
      
    </session>
 </sessions>
</tsung>